app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "text", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "My Tema"], ["text", "some text for my project"], ["created_at", 2017-03-18 14:55:47 UTC], ["updated_at", 2017-03-18 14:55:47 UTC]]
---
	def create
  		@post = Post.new(post_params)

  		if @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "posts" SET "photo_file_name" = $1, "photo_file_size" = $2, "photo_updated_at" = $3, "updated_at" = $4 WHERE "posts"."id" = $5  [["photo_file_name", "6e8683fb0badd4d96d8a99d5e33201bd.jpg"], ["photo_file_size", 118398], ["photo_updated_at", 2017-03-29 17:08:17 UTC], ["updated_at", 2017-03-29 17:08:17 UTC], ["id", 12]]
---
	def update
		@post = Post.find(params[:id])

		if @post.update(post_params)